---
kind: property
id: P:Autodesk.Revit.DB.PointOnPlane.Offset
zh: 偏移、偏移量
source: html/d118d5c7-a844-1d7c-9746-0af3c4d8e1a5.htm
---
# Autodesk.Revit.DB.PointOnPlane.Offset Property

**中文**: 偏移、偏移量

Signed offset from the plane.

## Syntax (C#)
```csharp
public double Offset { get; set; }
```

## Remarks
The point's position
is offset in the direction of the normal vector returned by
the Plane.Normal property.